RT-Thread/rt-thread/bsp/gd32/libraries/GD32F2xx_STD/GD32F20x_standard_peripheral/Source/gd32f20x_rcu.c
    /* exponent of AHB, APB1 and APB2 clock divider */
    uint8_t ahb_exp[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
    uint8_t apb1_exp[8] = {0, 0, 0, 0, 1, 2, 3, 4};
    uint8_t apb2_exp[8] = {0, 0, 0, 0, 1, 2, 3, 4};

    sws = GET_BITS(RCU_CFG0, 2, 3);
    switch(sws){
    /* IRC8M is selected as CK_SYS */
    case SEL_IRC8M:
        cksys_freq = IRC8M_VALUE;
        break;
    /* HXTAL is selected as CK_SYS */
    case SEL_HXTAL:
        cksys_freq = HXTAL_VALUE;
        break;
    /* PLL is selected as CK_SYS */
    case SEL_PLL:
        /* PLL clock source selection HXTAL or IRC8M/2 */
        pllsel = (RCU_CFG0 & RCU_CFG0_PLLSEL);

        if(RCU_PLLSRC_HXTAL == pllsel) {
            /* PLL clock source is HXTAL */
            ck_src = HXTAL_VALUE;

            predv0sel = (RCU_CFG1 & RCU_CFG1_PREDV0SEL);
            /* source clock use PLL1 */
            if(RCU_PREDV0SRC_CKPLL1 == predv0sel){
                predv1 = (uint32_t)((RCU_CFG1 & RCU_CFG1_PREDV1) >> 4) + 1U;
                pll1mf = (uint32_t)((RCU_CFG1 & RCU_CFG1_PLL1MF) >> 8) + 2U;

                if(17U == pll1mf){
                    pll1mf = 20U;
                }
                ck_src = (ck_src/predv1)*pll1mf;
            }
            predv0 = (RCU_CFG1 & RCU_CFG1_PREDV0) + 1U;
            ck_src /= predv0;
        }else{
            /* PLL clock source is IRC8M/2 */
            ck_src = IRC8M_VALUE/2U;
        }

        /* PLL multiplication factor */
        pllmf = GET_BITS(RCU_CFG0, 18, 21);
        if((RCU_CFG0 & RCU_CFG0_PLLMF_4)){
            pllmf |= 0x10U;
        }

        if(13U == pllmf){
            /* PLL source clock multiply by 6.5 */
            cksys_freq = ck_src*6U + ck_src/2U;
        }else{
            if(pllmf < 15U){
                pllmf += 2U;
            }else{
                pllmf += 1U;
            }
            cksys_freq = ck_src*pllmf;
        }
        break;
    /* IRC8M is selected as CK_SYS */
    default:
        cksys_freq = IRC8M_VALUE;
        break;
    }

    /* calculate AHB clock frequency */
    idx = GET_BITS(RCU_CFG0, 4, 7);
    clk_exp = ahb_exp[idx];
    ahb_freq = cksys_freq >> clk_exp;

    /* calculate APB1 clock frequency */
    idx = GET_BITS(RCU_CFG0, 8, 10);
    clk_exp = apb1_exp[idx];
    apb1_freq = ahb_freq >> clk_exp;

    /* calculate APB2 clock frequency */
    idx = GET_BITS(RCU_CFG0, 11, 13);
    clk_exp = apb2_exp[idx];
    apb2_freq = ahb_freq >> clk_exp;

    /* return the clocks frequency */
    switch(clock){
    case CK_SYS:
        ck_freq = cksys_freq;
        break;
    case CK_AHB:
        ck_freq = ahb_freq;
        break;
    case CK_APB1:
        ck_freq = apb1_freq;
        break;
    case CK_APB2:
        ck_freq = apb2_freq;
        break;
    default:
        break;
    }
    return ck_freq;
}

/*!
    \brief      configure the PLLT clock selection
    \param[in]  pllt_src: PLLT clock source selection
      \arg        RCU_PLLTSRC_IRC8M: IRC8M selected as source clock of PLLT
      \arg        RCU_PLLTSRC_HXTAL: HXTAL selected as source clock of PLLT
    \param[out] none
    \retval     none
*/
void rcu_pllt_config(uint32_t pllt_src)
{
    uint32_t reg = 0U;

    reg = RCU_PLLTCFG;

    /* reset the PLLT clock source bit PLLTSEL */
    reg &= ~RCU_PLLTCFG_PLLTSEL;

    RCU_PLLTCFG = (reg | pllt_src);
}

/*!
    \brief      configure the PLLT clock multiplication and division factors
    \param[in]  pllt_psc: the PLLT VCO input clock division factor
      \arg        this parameter should be selected between 2 and 63. And this parameter should
                  be selected correctly to ensure that the VCO input frequency ranges from 1 to 2 MHz
    \param[in]  pllt_mul: he PLLT VCO output clock multiplication factor
      \arg        this parameter should be selected between 49 and 432
    \param[in]  ppltr_psc: the PLLTR division factor
      \arg        this parameter should be selected between 2 and 7
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus rcu_pllt_vco_config(uint32_t pllt_psc, uint32_t pllt_mul, uint32_t ppltr_psc)
{
    uint32_t reg = 0U;

    /* check the function parameter */
    if((pllt_psc < 2U) || (pllt_psc > 63U)){
        return ERROR;
    }else{
    }

    if((pllt_mul < 49U) || (pllt_mul > 432U)){
        return ERROR;
    }else{
    }

    if((ppltr_psc < 2U) || (ppltr_psc > 7U)){
        return ERROR;
    }else{
    }

    reg = RCU_PLLTCFG;

    /* reset the PLLTRPSC bits, PLLTMF bits and PLLTPSC bits */
    reg &= ~(RCU_PLLTCFG_PLLTRPSC | RCU_PLLTCFG_PLLTMF | RCU_PLLTCFG_PLLTPSC);

    reg |= (PLLTCFG_PLLTPSC(pllt_psc) | PLLTCFG_PLLTMF(pllt_mul) | PLLTCFG_PLLTRPSC(ppltr_psc));

    RCU_PLLTCFG = reg;

    return SUCCESS;
}

/*!
    \brief      configure the TLI prescaler factor from PLLTR clock
    \param[in]  tli_psc: TLI prescaler factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKTLI_CKPLLTR_DIV2: TLI prescaler select CK_PLLTR/2
      \arg        RCU_CKTLI_CKPLLTR_DIV4: TLI prescaler select CK_PLLTR/4
      \arg        RCU_CKTLI_CKPLLTR_DIV8: TLI prescaler select CK_PLLTR/8
      \arg        RCU_CKTLI_CKPLLTR_DIV16: TLI prescaler select CK_PLLTR/16
    \param[out] none
    \retval     none
*/
void rcu_tli_clock_config(uint32_t tli_psc)
{
    uint32_t reg = 0U;

    reg = RCU_PLLTCFG;

    /* reset the TLIPSC bits */
    reg &= ~RCU_PLLTCFG_TLIPSC;

    RCU_PLLTCFG = (reg | tli_psc);
}

